Revit 2024 API
FilledRegion.GetValidLineStyleIdsForFilledRegion Method
 Gets the line style Ids which are permitted to be assigned to a filled region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IList<ElementId> GetValidLineStyleIdsForFilledRegion(
	Document document
)
Visual Basic
Public Shared Function GetValidLineStyleIdsForFilledRegion ( _
	document As Document _
) As IList(Of ElementId)
Visual C++
public:
static IList<ElementId^>^ GetValidLineStyleIdsForFilledRegion(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The valid line style Ids.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilledRegion Class
Autodesk.Revit.DB Namespace